## Got the Black Friday files(train, Test, and Sample) from Analytics Vidhya to predict the values based on the given input columns using the Linear Regression Model. 

Go to the link - https://datahack.analyticsvidhya.com/contest/black-friday/#ProblemStatement  for the files

In [1]:
import os
import pandas as pd
import numpy as np

In [3]:
os.chdir(r"C:\Users\kalya\Santhosh\Data Science\Notebook\Preprocessing")

In [4]:
train = pd.read_csv('Black_Friday_train.csv')

In [5]:
test = pd.read_csv('Black_Friday_test.csv')

In [6]:
sample = pd.read_csv('Black_Friday_sample_submission.csv')

In [93]:
sample.columns

Index(['Purchase', 'User_ID', 'Product_ID'], dtype='object')

In [8]:
train.shape, test.shape, sample.shape

((550068, 12), (233599, 11), (233599, 3))

In [9]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     550068 non-null  int64
 1   Product_ID                  550068 non-null  object
 2   Gender                      550068 non-null  object
 3   Age                         550068 non-null  object
 4   Occupation                  550068 non-null  int64
 5   City_Category               550068 non-null  object
 6   Stay_In_Current_City_Years  550068 non-null  object
 7   Marital_Status              550068 non-null  int64
 8   Product_Category_1          550068 non-null  int64
 9   Product_Category_2          376430 non-null  float64
 10  Product_Category_3          166821 non-null  float64
 11  Purchase                    550068 non-null  int64
dtypes: float64(2), int64(5), object(5)
memory usage: 50.4+ MB

In [10]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 233599 entries, 0 to 233598
Data columns (total 11 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     233599 non-null  int64
 1   Product_ID                  233599 non-null  object
 2   Gender                      233599 non-null  object
 3   Age                         233599 non-null  object
 4   Occupation                  233599 non-null  int64
 5   City_Category               233599 non-null  object
 6   Stay_In_Current_City_Years  233599 non-null  object
 7   Marital_Status              233599 non-null  int64
 8   Product_Category_1          233599 non-null  int64
 9   Product_Category_2          161255 non-null  float64
 10  Product_Category_3          71037 non-null   float64
dtypes: float64(2), int64(4), object(5)
memory usage: 19.6+ MB

In [13]:
train.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
User_ID,550068.0,NaN,NaN,NaN,1003028.842401,1727.591586,1000001.0,1001516.0,1003077.0,1004478.0,1006040.0
Product_ID,550068,3631,P00265242,1880,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Gender,550068,2,M,414259,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Age,550068,7,26-35,219587,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Occupation,550068.0,NaN,NaN,NaN,8.076707,6.52266,0.0,2.0,7.0,14.0,20.0
City_Category,550068,3,B,231173,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Stay_In_Current_City_Years,550068,5,1,193821,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Marital_Status,550068.0,NaN,NaN,NaN,0.409653,0.49177,0.0,0.0,0.0,1.0,1.0
Product_Category_1,550068.0,NaN,NaN,NaN,5.40427,3.936211,1.0,1.0,5.0,8.0,20.0
Product_Category_2,376430.0,NaN,NaN,NaN,9.842329,5.08659,2.0,5.0,9.0,15.0,18.0
Product_Category_3,166821.0,NaN,NaN,NaN,12.668243,4.125338,3.0,9.0,14.0,16.0,18.0
Purchase,550068.0,NaN,NaN,NaN,9263.968713,5023.065394,12.0,5823.0,8047.0,12054.0,23961.0

In [14]:
train.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            173638
Product_Category_3            383247
Purchase                           0
dtype: int64

In [16]:
train.Product_Category_3.value_counts()

16.0    32636
15.0    28013
14.0    18428
17.0    16702
5.0     16658
8.0     12562
9.0     11579
12.0     9246
13.0     5459
6.0      4890
18.0     4629
4.0      1875
11.0     1805
10.0     1726
3.0       613
Name: Product_Category_3, dtype: int64

In [19]:
train.columns[train.dtypes == 'object']

Index(['Product_ID', 'Gender', 'Age', 'City_Category',
       'Stay_In_Current_City_Years'],
      dtype='object')

In [20]:
train.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase'],
      dtype='object')

In [ ]:
Problem:

1. User_ID - Int
2. Product_ID - Object, remove p in the product ID and then given product id convert from object to int
3. Gender - Object, use one hot encoding
4. Age - Object, one hot encoding
5. Occupation - Int
6. City_Category - Object, one hot encoding
7. Stay_In_Current_City_Years - Object, convert object datatype to integer datatype
8. Marital_Status - Int
9. Product_Category_1 - Float
10. Product_Category_2 - Float
11. Product_Category_3 - Float
12. Purchase - output variable

In [81]:
train.duplicated().sum()

0

In [75]:
train.Product_ID.str[1:9].astype(int).value_counts()

265242    1880
25442     1615
110742    1612
112142    1562
57642     1470
          ...
314842       1
298842       1
231642       1
204442       1
66342        1
Name: Product_ID, Length: 3631, dtype: int64

In [251]:
train.Product_ID[:5]

0    P00069042
1    P00248942
2    P00087842
3    P00085442
4    P00285442
Name: Product_ID, dtype: object

In [254]:
data.Product_ID.str[1:9].value_counts()

00265242    2709
00025442    2310
00110742    2292
00112142    2279
00046742    2084
            ...
00185942       1
00104342       1
00074742       1
00081342       1
00253842       1
Name: Product_ID, Length: 3677, dtype: int64

In [253]:
data.Product_ID.str[0:1].value_counts()

P    783667
Name: Product_ID, dtype: int64

In [54]:
train.Gender.value_counts().sort_values()

F    135809
M    414259
Name: Gender, dtype: int64

In [55]:
train.City_Category.value_counts()

B    231173
C    171175
A    147720
Name: City_Category, dtype: int64

In [56]:
train.Stay_In_Current_City_Years.value_counts()

1     193821
2     101838
3      95285
4+     84726
0      74398
Name: Stay_In_Current_City_Years, dtype: int64

In [69]:
train.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

In [72]:
train.Stay_In_Current_City_Years.str[:1].astype(int).value_counts()

1    193821
2    101838
3     95285
4     84726
0     74398
Name: Stay_In_Current_City_Years, dtype: int64

In [82]:
train['source'] = 'train'
test['source'] = 'test'

In [90]:
train.shape

(550068, 13)

In [85]:
train

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,source
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370,train
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200,train
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422,train
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057,train
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969,train
...,...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,M,51-55,13,B,1,1,20,NaN,NaN,368,train
550064,1006035,P00375436,F,26-35,1,C,3,0,20,NaN,NaN,371,train
550065,1006036,P00375436,F,26-35,15,B,4+,1,20,NaN,NaN,137,train
550066,1006038,P00375436,F,55+,1,C,2,0,20,NaN,NaN,365,train
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,NaN,NaN,490,train

In [91]:
test.shape

(233599, 12)

In [86]:
test

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,source
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN,test
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN,test
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN,test
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN,test
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0,test
...,...,...,...,...,...,...,...,...,...,...,...,...
233594,1006036,P00118942,F,26-35,15,B,4+,1,8,NaN,NaN,test
233595,1006036,P00254642,F,26-35,15,B,4+,1,5,8.0,NaN,test
233596,1006036,P00031842,F,26-35,15,B,4+,1,1,5.0,12.0,test
233597,1006037,P00124742,F,46-50,1,C,4+,0,10,16.0,NaN,test
233598,1006039,P00316642,F,46-50,0,B,4+,1,4,5.0,NaN,test

In [87]:
data = pd.concat([train,test])

In [88]:
data

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,source
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370.0,train
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200.0,train
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422.0,train
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057.0,train
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969.0,train
...,...,...,...,...,...,...,...,...,...,...,...,...,...
233594,1006036,P00118942,F,26-35,15,B,4+,1,8,NaN,NaN,NaN,test
233595,1006036,P00254642,F,26-35,15,B,4+,1,5,8.0,NaN,NaN,test
233596,1006036,P00031842,F,26-35,15,B,4+,1,1,5.0,12.0,NaN,test
233597,1006037,P00124742,F,46-50,1,C,4+,0,10,16.0,NaN,NaN,test
233598,1006039,P00316642,F,46-50,0,B,4+,1,4,5.0,NaN,NaN,test

In [89]:
data.shape

(783667, 13)

In [92]:
data.isna().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            245982
Product_Category_3            545809
Purchase                      233599
source                             0
dtype: int64

In [100]:
data['Product_ID_int'] = data.Product_ID.str[1:9].astype(int)

In [116]:
data.Gender.value_counts()

0    590031
1    193636
Name: Gender, dtype: int64

In [125]:
data['Gender'].replace({'M' :0, 'F':'1'}, inplace = True)

In [126]:
data['Gender'] = data.Gender.astype(int)

In [127]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 783667 entries, 0 to 233598
Data columns (total 15 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   User_ID                         783667 non-null  int64
 1   Product_ID                      783667 non-null  object
 2   Gender                          783667 non-null  int32
 3   Age                             783667 non-null  object
 4   Occupation                      783667 non-null  int64
 5   City_Category                   783667 non-null  object
 6   Stay_In_Current_City_Years      783667 non-null  object
 7   Marital_Status                  783667 non-null  int64
 8   Product_Category_1              783667 non-null  int64
 9   Product_Category_2              783667 non-null  int32
 10  Product_Category_3              783667 non-null  int32
 11  Purchase                        550068 non-null  float64
 12  source                          783667 non-null  object
 13  Product_ID_int                  783667 non-null  int32
 14  Stay_In_Current_City_Years_int  783667 non-null  int32
dtypes: float64(1), int32(5), int64(4), object(5)
memory usage: 80.7+ MB

In [128]:
data.City_Category.value_counts()

B    329739
C    243684
A    210244
Name: City_Category, dtype: int64

In [117]:
data.isnull().sum()

User_ID                                0
Product_ID                             0
Gender                                 0
Age                                    0
Occupation                             0
City_Category                          0
Stay_In_Current_City_Years             0
Marital_Status                         0
Product_Category_1                     0
Product_Category_2                     0
Product_Category_3                     0
Purchase                          233599
source                                 0
Product_ID_int                         0
Stay_In_Current_City_Years_int         0
dtype: int64

In [103]:
data['Stay_In_Current_City_Years_int'] = data.Stay_In_Current_City_Years.str[:1].astype(int)

### Handling missing values

In [113]:
data['Product_Category_2'].fillna(0,inplace = True)
data['Product_Category_3'].fillna(0,inplace = True)
data['Product_Category_2'] = data['Product_Category_2'].astype(int) 
data['Product_Category_3'] = data['Product_Category_3'].astype(int)

In [129]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 783667 entries, 0 to 233598
Data columns (total 15 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   User_ID                         783667 non-null  int64
 1   Product_ID                      783667 non-null  object
 2   Gender                          783667 non-null  int32
 3   Age                             783667 non-null  object
 4   Occupation                      783667 non-null  int64
 5   City_Category                   783667 non-null  object
 6   Stay_In_Current_City_Years      783667 non-null  object
 7   Marital_Status                  783667 non-null  int64
 8   Product_Category_1              783667 non-null  int64
 9   Product_Category_2              783667 non-null  int32
 10  Product_Category_3              783667 non-null  int32
 11  Purchase                        550068 non-null  float64
 12  source                          783667 non-null  object
 13  Product_ID_int                  783667 non-null  int32
 14  Stay_In_Current_City_Years_int  783667 non-null  int32
dtypes: float64(1), int32(5), int64(4), object(5)
memory usage: 80.7+ MB

In [105]:
data.Stay_In_Current_City_Years_int.value_counts()

1    276425
2    145427
3    135428
4    120671
0    105716
Name: Stay_In_Current_City_Years_int, dtype: int64

In [120]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 783667 entries, 0 to 233598
Data columns (total 15 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   User_ID                         783667 non-null  int64
 1   Product_ID                      783667 non-null  object
 2   Gender                          783667 non-null  object
 3   Age                             783667 non-null  object
 4   Occupation                      783667 non-null  int64
 5   City_Category                   783667 non-null  object
 6   Stay_In_Current_City_Years      783667 non-null  object
 7   Marital_Status                  783667 non-null  int64
 8   Product_Category_1              783667 non-null  int64
 9   Product_Category_2              783667 non-null  int32
 10  Product_Category_3              783667 non-null  int32
 11  Purchase                        550068 non-null  float64
 12  source                          783667 non-null  object
 13  Product_ID_int                  783667 non-null  int32
 14  Stay_In_Current_City_Years_int  783667 non-null  int32
dtypes: float64(1), int32(4), int64(4), object(6)
memory usage: 83.7+ MB

In [130]:
data_numbers = data.select_dtypes(include=np.number)

In [132]:
data_numbers.shape

(783667, 10)

In [131]:
data_numbers.head()

,User_ID,Gender,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,Product_ID_int,Stay_In_Current_City_Years_int
0,1000001,1,10,0,3,0,0,8370.0,69042,2
1,1000001,1,10,0,1,6,14,15200.0,248942,2
2,1000001,1,10,0,12,0,0,1422.0,87842,2
3,1000001,1,10,0,12,14,0,1057.0,85442,2
4,1000002,0,16,0,8,0,0,7969.0,285442,4

In [134]:
data_numbers.describe().T

,count,mean,std,min,25%,50%,75%,max
User_ID,783667.0,1.003029e+06,1727.266668,1000001.0,1001519.0,1003075.0,1004478.0,1006040.0
Gender,783667.0,2.470896e-01,0.431320,0.0,0.0,0.0,0.0,1.0
Occupation,783667.0,8.079300e+00,6.522206,0.0,2.0,7.0,14.0,20.0
Marital_Status,783667.0,4.097774e-01,0.491793,0.0,0.0,0.0,1.0,1.0
Product_Category_1,783667.0,5.366196e+00,3.878160,1.0,1.0,5.0,8.0,20.0
Product_Category_2,783667.0,6.754454e+00,6.216205,0.0,0.0,5.0,14.0,18.0
Product_Category_3,783667.0,3.845165e+00,6.252476,0.0,0.0,0.0,8.0,18.0
Purchase,550068.0,9.263969e+03,5023.065394,12.0,5823.0,8047.0,12054.0,23961.0
Product_ID_int,783667.0,1.742690e+05,102432.938860,142.0,97042.0,169042.0,258742.0,375436.0
Stay_In_Current_City_Years_int,783667.0,1.858247e+00,1.288790,0.0,1.0,2.0,3.0,4.0

In [118]:
data[['Product_Category_1','Product_Category_2','Product_Category_3']]

        Product_Category_1  Product_Category_2  Product_Category_3
0                        3                   0                   0
1                        1                   6                  14
2                       12                   0                   0
3                       12                  14                   0
4                        8                   0                   0
...                    ...                 ...                 ...
233594                   8                   0                   0
233595                   5                   8                   0
233596                   1                   5                  12
233597                  10                  16                   0
233598                   4                   5                   0

[783667 rows x 3 columns]

In [119]:
data['Product_Category_1']+data['Product_Category_2']+data['Product_Category_3']

0          3
1         21
2         12
3         26
4          8
          ..
233594     8
233595    13
233596    18
233597    26
233598     9
Length: 783667, dtype: int64

In [133]:
from sklearn.preprocessing import StandardScaler

In [135]:
scale = StandardScaler()
scaled = scale.fit_transform(data_numbers.drop(columns="Purchase"))
data_numbers = pd.DataFrame(scaled, columns=data_numbers.drop(columns="Purchase").columns)

In [136]:
data_numbers

,User_ID,Gender,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Product_ID_int,Stay_In_Current_City_Years_int
0,-1.753057,1.745599,0.294486,-0.833232,-0.610134,-1.086589,-0.614983,-1.027277,0.109989
1,-1.753057,1.745599,0.294486,-0.833232,-1.125843,-0.121369,1.624131,0.728995,0.109989
2,-1.753057,1.745599,0.294486,-0.833232,1.710556,-1.086589,-0.614983,-0.843742,0.109989
3,-1.753057,1.745599,0.294486,-0.833232,1.710556,1.165591,-0.614983,-0.867172,0.109989
4,-1.752478,-0.572869,1.214421,-0.833232,0.679138,-1.086589,-0.614983,1.085326,1.661833
...,...,...,...,...,...,...,...,...,...
783662,1.740904,1.745599,1.061099,1.200146,0.679138,-1.086589,-0.614983,-0.540129,1.661833
783663,1.740904,1.745599,1.061099,1.200146,-0.094425,0.200371,-0.614983,0.784641,1.661833
783664,1.740904,1.745599,1.061099,1.200146,-1.125843,-0.282239,1.304258,-1.390442,1.661833
783665,1.741483,1.745599,-1.085416,-0.833232,1.194847,1.487331,-0.614983,-0.483507,1.661833
783666,1.742641,1.745599,-1.238738,1.200146,-0.352280,-0.282239,-0.614983,1.389915,1.661833

In [137]:
data_category = data.select_dtypes(exclude=np.number)

In [138]:
data_category.columns

Index(['Product_ID', 'Age', 'City_Category', 'Stay_In_Current_City_Years',
       'source'],
      dtype='object')

In [139]:
data_category_one_hot = pd.get_dummies(data_category.drop(columns=['source','Product_ID', 'Stay_In_Current_City_Years']))

In [140]:
data_numbers = data_numbers.reset_index(drop=True)
data_category_one_hot = data_category_one_hot.reset_index(drop=True )
data = data.reset_index(drop =True)

In [195]:
data_preprocessed = pd.concat([data_numbers, data_category_one_hot, data[['Product_ID','Stay_In_Current_City_Years','source','Purchase','User_ID']]], axis = 1)
data_preprocessed.columns

Index(['User_ID', 'Gender', 'Occupation', 'Marital_Status',
       'Product_Category_1', 'Product_Category_2', 'Product_Category_3',
       'Product_ID_int', 'Stay_In_Current_City_Years_int', 'Age_0-17',
       'Age_18-25', 'Age_26-35', 'Age_36-45', 'Age_46-50', 'Age_51-55',
       'Age_55+', 'City_Category_A', 'City_Category_B', 'City_Category_C',
       'Product_ID', 'Stay_In_Current_City_Years', 'source', 'Purchase',
       'User_ID'],
      dtype='object')

In [196]:
data_category_one_hot.columns

Index(['Age_0-17', 'Age_18-25', 'Age_26-35', 'Age_36-45', 'Age_46-50',
       'Age_51-55', 'Age_55+', 'City_Category_A', 'City_Category_B',
       'City_Category_C'],
      dtype='object')

In [197]:
data_numbers.columns

Index(['User_ID', 'Gender', 'Occupation', 'Marital_Status',
       'Product_Category_1', 'Product_Category_2', 'Product_Category_3',
       'Product_ID_int', 'Stay_In_Current_City_Years_int'],
      dtype='object')

In [198]:
data.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase', 'source',
       'Product_ID_int', 'Stay_In_Current_City_Years_int'],
      dtype='object')

In [199]:
data_preprocessed.source.value_counts()

train    550068
test     233599
Name: source, dtype: int64

In [200]:
train_preprocessed = data_preprocessed[data_preprocessed['source']=='train'].drop(columns='source')
test_preprocessed = data_preprocessed[data_preprocessed['source']=='test'].drop(columns=['source', 'Purchase'])

In [201]:
train_preprocessed.to_csv("Black_Friday_train_preprocessed.csv", index = False)
test_preprocessed.to_csv("Black_Friday_test_preprocessed.csv", index = False)

In [202]:
train1 = pd.read_csv("Black_Friday_train_preprocessed.csv")
test1 = pd.read_csv("Black_Friday_test_preprocessed.csv")
sample1 = pd.read_csv("Black_Friday_sample_submission.csv")

In [203]:
sample1.head()

   Purchase  User_ID Product_ID
0       100  1000004  P00128942
1       100  1000009  P00113442
2       100  1000010  P00288442
3       100  1000010  P00145342
4       100  1000011  P00053842

In [217]:
test1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 233599 entries, 0 to 233598
Data columns (total 22 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   User_ID                         233599 non-null  float64
 1   Gender                          233599 non-null  float64
 2   Occupation                      233599 non-null  float64
 3   Marital_Status                  233599 non-null  float64
 4   Product_Category_1              233599 non-null  float64
 5   Product_Category_2              233599 non-null  float64
 6   Product_Category_3              233599 non-null  float64
 7   Product_ID_int                  233599 non-null  float64
 8   Stay_In_Current_City_Years_int  233599 non-null  float64
 9   Age_0-17                        233599 non-null  int64
 10  Age_18-25                       233599 non-null  int64
 11  Age_26-35                       233599 non-null  int64
 12  Age_36-45                       233599 non-null  int64
 13  Age_46-50                       233599 non-null  int64
 14  Age_51-55                       233599 non-null  int64
 15  Age_55+                         233599 non-null  int64
 16  City_Category_A                 233599 non-null  int64
 17  City_Category_B                 233599 non-null  int64
 18  City_Category_C                 233599 non-null  int64
 19  Product_ID                      233599 non-null  object
 20  Stay_In_Current_City_Years      233599 non-null  object
 21  User_ID.1                       233599 non-null  int64
dtypes: float64(9), int64(11), object(2)
memory usage: 39.2+ MB

In [204]:
train1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 23 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   User_ID                         550068 non-null  float64
 1   Gender                          550068 non-null  float64
 2   Occupation                      550068 non-null  float64
 3   Marital_Status                  550068 non-null  float64
 4   Product_Category_1              550068 non-null  float64
 5   Product_Category_2              550068 non-null  float64
 6   Product_Category_3              550068 non-null  float64
 7   Product_ID_int                  550068 non-null  float64
 8   Stay_In_Current_City_Years_int  550068 non-null  float64
 9   Age_0-17                        550068 non-null  int64
 10  Age_18-25                       550068 non-null  int64
 11  Age_26-35                       550068 non-null  int64
 12  Age_36-45                       550068 non-null  int64
 13  Age_46-50                       550068 non-null  int64
 14  Age_51-55                       550068 non-null  int64
 15  Age_55+                         550068 non-null  int64
 16  City_Category_A                 550068 non-null  int64
 17  City_Category_B                 550068 non-null  int64
 18  City_Category_C                 550068 non-null  int64
 19  Product_ID                      550068 non-null  object
 20  Stay_In_Current_City_Years      550068 non-null  object
 21  Purchase                        550068 non-null  float64
 22  User_ID.1                       550068 non-null  int64
dtypes: float64(10), int64(11), object(2)
memory usage: 96.5+ MB

In [205]:
train1.columns

Index(['User_ID', 'Gender', 'Occupation', 'Marital_Status',
       'Product_Category_1', 'Product_Category_2', 'Product_Category_3',
       'Product_ID_int', 'Stay_In_Current_City_Years_int', 'Age_0-17',
       'Age_18-25', 'Age_26-35', 'Age_36-45', 'Age_46-50', 'Age_51-55',
       'Age_55+', 'City_Category_A', 'City_Category_B', 'City_Category_C',
       'Product_ID', 'Stay_In_Current_City_Years', 'Purchase', 'User_ID.1'],
      dtype='object')

In [206]:
X = train1.drop(columns = ["Product_ID", "User_ID", "Stay_In_Current_City_Years", "Purchase"])
y = train1['Purchase']

## Modeling

In [207]:
from sklearn.model_selection import train_test_split

In [208]:
train_X, test_X, train_y, test_y = train_test_split(X,y, test_size = 0.2, random_state=32)

In [209]:
from sklearn.linear_model import LinearRegression

In [210]:
model = LinearRegression()

In [211]:
train_X.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 440054 entries, 19432 to 10967
Data columns (total 19 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   Gender                          440054 non-null  float64
 1   Occupation                      440054 non-null  float64
 2   Marital_Status                  440054 non-null  float64
 3   Product_Category_1              440054 non-null  float64
 4   Product_Category_2              440054 non-null  float64
 5   Product_Category_3              440054 non-null  float64
 6   Product_ID_int                  440054 non-null  float64
 7   Stay_In_Current_City_Years_int  440054 non-null  float64
 8   Age_0-17                        440054 non-null  int64
 9   Age_18-25                       440054 non-null  int64
 10  Age_26-35                       440054 non-null  int64
 11  Age_36-45                       440054 non-null  int64
 12  Age_46-50                       440054 non-null  int64
 13  Age_51-55                       440054 non-null  int64
 14  Age_55+                         440054 non-null  int64
 15  City_Category_A                 440054 non-null  int64
 16  City_Category_B                 440054 non-null  int64
 17  City_Category_C                 440054 non-null  int64
 18  User_ID.1                       440054 non-null  int64
dtypes: float64(8), int64(11)
memory usage: 67.1 MB

In [212]:
train_y

19432      9809.0
347539     6908.0
148255     9622.0
197865    15864.0
110099     7854.0
           ...
384403     3925.0
387160    16660.0
282558     7139.0
370219    11486.0
10967      8800.0
Name: Purchase, Length: 440054, dtype: float64

In [213]:
model.fit(train_X, train_y)

LinearRegression()

In [214]:
model.coef_

array([-2.12466610e+02,  4.06117287e+01, -1.65810761e+01, -1.34491896e+03,
        5.25665503e+01,  8.64056413e+02, -2.77846394e+02,  1.25186059e+01,
       -5.16867697e+02, -1.86053911e+02, -1.13280619e+00,  7.92573690e+01,
        5.15410591e+01,  3.72159755e+02,  2.01096231e+02, -2.74016033e+02,
       -1.26286142e+02,  4.00302175e+02,  1.11050576e-02])

In [215]:
model.intercept_

-1858.5847330773813

In [216]:
test1.columns

Index(['User_ID', 'Gender', 'Occupation', 'Marital_Status',
       'Product_Category_1', 'Product_Category_2', 'Product_Category_3',
       'Product_ID_int', 'Stay_In_Current_City_Years_int', 'Age_0-17',
       'Age_18-25', 'Age_26-35', 'Age_36-45', 'Age_46-50', 'Age_51-55',
       'Age_55+', 'City_Category_A', 'City_Category_B', 'City_Category_C',
       'Product_ID', 'Stay_In_Current_City_Years', 'User_ID.1'],
      dtype='object')

In [222]:
test1['User_ID.1']

0         1000004
1         1000009
2         1000010
3         1000010
4         1000011
           ...
233594    1006036
233595    1006036
233596    1006036
233597    1006037
233598    1006039
Name: User_ID.1, Length: 233599, dtype: int64

In [223]:
train_X_pred = model.predict(train_X)
test_X_pred = model.predict(test_X)

#actual test data from hackathon
test_pred = model.predict(test1.drop(columns = ["Product_ID", "Stay_In_Current_City_Years","User_ID.1"]))

In [224]:
from sklearn.metrics import mean_squared_error, mean_absolute_error, mean_absolute_percentage_error, r2_score

In [225]:
train_X_RMSE = np.sqrt(mean_squared_error(train_y, train_X_pred))
test_X_RMSE = np.sqrt(mean_squared_error(test_y, test_X_pred))

In [226]:
print("Train RMSE : ",train_X_RMSE)
print("Test RMSE : ",test_X_RMSE)

Train RMSE :  4616.50699523221
Test RMSE :  4610.652295833031

In [227]:
train_X_R2 = r2_score(train_y, train_X_pred)
test_X_R2 = r2_score(test_y, test_X_pred)

In [228]:
print("Train R2 : ",train_X_R2)
print("Test R2 : ",test_X_R2)

Train R2 :  0.15652481958296172
Test R2 :  0.15262177677395972

In [233]:
test_pred_modified = np.where(test_pred<0,0,test_pred)

In [234]:
test_pred_modified

array([  0.        , 299.59380437,   0.        , ...,   0.        ,
         6.91482794,   0.        ])

In [235]:
test1['Purchase'] = test_pred_modified

In [236]:
test1.head()

,User_ID,Gender,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Product_ID_int,Stay_In_Current_City_Years_int,Age_0-17,...,Age_46-50,Age_51-55,Age_55+,City_Category_A,City_Category_B,City_Category_C,Product_ID,Stay_In_Current_City_Years,User_ID.1,Purchase
0,-1.751321,-0.572869,-0.165481,1.200146,-1.125843,0.682981,-0.614983,-0.442504,0.109989,0,...,1,0,0,0,1,0,P00128942,2,1000004,0.000000
1,-1.748426,-0.572869,1.367744,-0.833232,-0.610134,-0.282239,-0.614983,-0.593823,-1.441855,0,...,0,0,0,0,0,1,P00113442,0,1000009,299.593804
2,-1.747847,1.745599,-1.085416,1.200146,-0.094425,1.165591,-0.614983,1.114613,1.661833,0,...,0,0,0,0,1,0,P00288442,4+,1000010,0.000000
3,-1.747847,1.745599,-1.085416,1.200146,-0.352280,0.361241,-0.614983,-0.282399,1.661833,0,...,0,0,0,0,1,0,P00145342,4+,1000010,0.000000
4,-1.747268,1.745599,-1.085416,-0.833232,-0.352280,-0.282239,1.304258,-1.175667,-0.665933,0,...,0,0,0,0,0,1,P00053842,1,1000011,0.000000

In [242]:
Output = test1[["User_ID.1","Product_ID","Purchase"]]

In [246]:
Output

        User_ID Product_ID    Purchase
0       1000004  P00128942    0.000000
1       1000009  P00113442  299.593804
2       1000010  P00288442    0.000000
3       1000010  P00145342    0.000000
4       1000011  P00053842    0.000000
...         ...        ...         ...
233594  1006036  P00118942    0.000000
233595  1006036  P00254642    0.000000
233596  1006036  P00031842    0.000000
233597  1006037  P00124742    6.914828
233598  1006039  P00316642    0.000000

[233599 rows x 3 columns]

In [245]:
Output.rename(columns = {"User_ID.1":"User_ID"}, inplace = True)

In [247]:
Output.to_csv("Black_Friday_Result_LR_with_80percent_traindata_abs.csv", index = False)

In [241]:
sample

        Purchase  User_ID Product_ID
0            100  1000004  P00128942
1            100  1000009  P00113442
2            100  1000010  P00288442
3            100  1000010  P00145342
4            100  1000011  P00053842
...          ...      ...        ...
233594       100  1006036  P00118942
233595       100  1006036  P00254642
233596       100  1006036  P00031842
233597       100  1006037  P00124742
233598       100  1006039  P00316642

[233599 rows x 3 columns]